{
  "HomePage": {
    "choose_file": "Choose File",
    "pls_select_a_file_to_edit": "Please select a file to edit",
    "choose_language": "Choose Language",
    "new_version_button": "New version available🚀"
  },
  "EditorNavBar": {
    "HomePage": "Home Page",
    "MenuEditor": "Menu",
    "MateEditor": "Mate",
    "PMateEditor": "PMate",
    "ColEditor": "Col",
    "PhyEditor": "Phy",
    "AnmEditor": "Anm",
    "ModelEditor": "Model",
    "PskEditor": "Psk",
    "open_file": "Open File",
    "save_file": "Save File",
    "save_as_file": "Save As"
  },
  "MenuEditor": {
    "treeIndent": "Tree Indentation",
    "colonSplit": "Colon Split",
    "JSON": "JSON",
    "TSV": "TSV",
    "file_header": {
      "file_head_usually_no_modify_required": "File Header (usually no modification required)",
      "Signature": "File Signature",
      "BodySize": "Body Size",
      "Version": "File Version",
      "enable_edit_do_not_edit": "Do not modify",
      "SrcFileName": "Source File Path",
      "SrcFileName_tip": "Source file path; usually not needed, but should not be empty. The game mainly uses it in error logs. For non-Japanese versions, it attempts to match translations.",
      "ItemName": "Item Name",
      "ItemName_tip": "Item Name; not used, but should not be empty. The game reads and discards this value.",
      "Category": "Category",
      "Category_tip": "Item category; not used, but should not be empty. The game reads and discards this value.",
      "SetInfoText": "Item Description",
      "SetInfoText_tip": "Item Description; usually not used, but should not be empty. If the value is acctatoo or hokuro, the game deletes certain slot accessories."
    },
    "commands": {
      "メニューフォルダ": "This command specifies the menu folder path. If parameter 1 is 'man', it marks as male menu, keep clothing as DRESS (2.42.1).",
      "category": "Specifies the category of this menu, the parameter must be a value from the MPN enumeration.",
      "属性追加": "Seems to have no effect, cannot find this value in the code (2.42.1).",
      "catno": "Seems to have no effect, cannot find this value in the code, but for safety, set parameter to 0 (2.42.1).",
      "priority": "Specifies the priority of the menu item. Higher values appear later, use float, do not set below 0 as 0 means delete the menu.",
      "name": "Specifies the name of the menu item",
      "setumei": "Specifies the description of the menu item, use 《改行》 for line breaks.",
      "icons": "Specifies the icon for the menu item, provide full filename like foo.tex, alias icon",
      "icon": "Specifies the icon for the menu item, provide full filename like foo.tex, alias icons",
      "iconl": "Seems to have no effect, the game checks if it’s not this value but does nothing (2.42.1).",
      "onclickmenu": "Seems to have no effect, cannot find this value in the code, seems to be just a visual divider (2.42.1).",
      "消去node設定開始": "Seems to have no effect, cannot find this value in the code, seems to be just a visual divider (2.42.1).",
      "消去node設定終了": "Seems to have no effect, cannot find this value in the code, seems to be just a visual divider (2.42.1).",
      "node消去": "Used to hide a bone and its corresponding vertex group. Parameter 1 is the bone name keyword. Any bone with this keyword will be hidden, but category must be in m_strDefSlotName values.",
      "setstr": "Seems to have no effect, the game checks if it’s not this value but does nothing (2.42.1).",
      "color_set": "Specifies a color for a category, parameter 1 is MPN enum, parameter 2 is the color.",
      "tex": "Specifies a texture to change, parameter 1 is MPN enum, parameter 2 is texture ID, parameter 3 is texture file name (foo.mate), parameter 4 is unknown, parameter 5 is infinite color category. Alias: テクスチャ変更.",
      "マテリアル変更": "Specifies a texture to change, parameter 1 is MPN enum, parameter 2 is texture ID, parameter 3 is texture file name (foo.mate), parameter 4 is unknown, parameter 5 is infinite color category. Alias: tex.",
      "アイテムパラメータ": "Sets additional parameters for an item slot (variable name, value), like specific attributes of items. Parameter 1 is MPN enum, parameter 2 is variable name, parameter 3 is value.",
      "additem": "Adds a model to a specified category, parameters must be 2, 4, or 5, parameter 1 is MPN enum, parameter 2 is model file (foo.model), parameter 3 is attach, parameter 4 is attachment point MPN enum, parameter 5 is attachment point name.",
      "delitem": "Removes a model from the specified category, parameter 1 is MPN enum.",
      "collabo": "No parameters, marks this item as a collaborative item."
    },
    "snippet": {
      "pre_filled": "Pre-filled",
      "pre_filled_tip": "Pre-filled; multi-line insert with parameter placeholders",
      "name": "Item Name",
      "setumei": "Item Description",
      "MPN": "MPN Enum (Category options)",
      "model_filename": "Model File Name (foo.model)",
      "icon_filename": "Icon File Name (foo.tex)",
      "maskitem": "MPN Enum (Category options)",
      "mate_number": "Material ID",
      "mate_filename": "Material File Name (foo.mat)",
      "bone_name_keyword": "Bone Name Keyword",
      "mate_name": "Material Name",
      "layer_number": "Layer Number",
      "tex_filename": "Texture File Name (foo.tex)",
      "blend_mode": "Blend Mode"
    },
    "menu_editor_help": "Menu Editor Help",
    "shortcut": "Shortcut",
    "ctrl_space": "Press Ctrl + Space for autocomplete options in Tree Indentation format",
    "other_shortcuts": "For other shortcuts, refer to Monaco Editor's default shortcuts",
    "note": "Note",
    "format_tree_tsv_use_tab": "Use Tab key for tree indentation and TSV formats, not spaces.",
    "only_tree_indent_have_autocomplete": "Autocomplete and hints are only available in Tree Indentation format."
  },
  "MateEditor": {
    "file_header": {
      "file_head": "File Header",
      "Signature": "File Signature",
      "Version": "File Version",
      "enable_edit_do_not_edit": "Do not modify",
      "Name": "Name",
      "Name_tip": "Name for your reference; the game reads and discards this (2.42.1).",
      "Material_Name": "Material Name",
      "Material_Name_tip": "Material Name; the game assigns this to material.name and tries to find the same named .pmat file.",
      "Material_ShaderName": "Shader Name",
      "Material_ShaderName_tip": "Shader Name; the game tries to find a shader with the same name.",
      "Material_ShaderFilename": "Shader Filename",
      "Material_ShaderFilename_tip": "Shader Filename; the game tries to find the shader file at a specific path."
    },
    "add_new_property": "Add New Property",
    "property": "Property",
    "property_name": "Property Name",
    "property_name_tip": "Property Name; the game assigns this to the corresponding name (e.g., texture name, color name).",
    "property_value": "Property Value",
    "property_type": "Property Type",
    "no_name": "Unnamed",
    "all": "All",
    "tex": "Texture (tex)",
    "tex_no_brackets": "Texture",
    "col": "Color (col)",
    "col_no_brackets": "Color",
    "col_tip": "Color (col); the value range is 0-1, not 0-255.",
    "f": "Float (f)",
    "f_no_brackets": "Float",
    "f_tip": "Float (f); the game assigns this float value to the corresponding texture name.",
    "vec": "Vector (vec)",
    "vec_no_brackets": "Vector",
    "vec_tip": "Vector (vec); similar to color but with RGBA replaced by XYZW. The game assigns this to the corresponding texture's color.",
    "unknown": "Unknown",
    "style1": "Style 1",
    "style2": "Style 2",
    "style3": "JSON",
    "subTag": "Sub Type",
    "tex2d": "2D Texture (tex2d)",
    "tex_cube": "Cube Texture (cube)",
    "texRT": "Render Texture (texRT)",
    "tex_null": "Null Texture (null)",
    "tex2dName": "2D Texture Name",
    "tex2dName_tip": "2D Texture Name; the game attempts to load a texture file with this name.",
    "tex2dPath": "2D Texture Path",
    "tex2dPath_tip": "2D Texture Path; not used, but should not be empty.",
    "offsetX": "Offset X",
    "offsetY": "Offset Y",
    "scaleX": "Scale X",
    "scaleY": "Scale Y",
    "unknown_text_1": "Unknown Text 1",
    "unknown_text_1_tip": "Unknown Text 1; not used, likely related to Render Texture.",
    "unknown_text_2": "Unknown Text 2",
    "unknown_text_2_tip": "Unknown Text 2; not used, likely related to Render Texture.",
    "R": "Red (R)",
    "G": "Green (G)",
    "B": "Blue (B)",
    "A": "Alpha (A)",
    "vec_x": "Vector X",
    "vec_y": "Vector Y",
    "vec_z": "Vector Z",
    "vec_w": "Vector W",
    "number": "Number",
    "color_picker": "Color Picker",
    "range": "Range",
    "range_no_brackets": "Range",
    "range_tip": "Range; effective only in COM3D2.5+.",
    "tex_offset": "Texture Offset",
    "tex_offset_no_brackets": "Texture Offset",
    "tex_offset_tip": "Texture Offset; effective only in COM3D2.5+.",
    "tex_scale": "Texture Scale",
    "tex_scale_no_brackets": "Texture Scale",
    "tex_scale_tip": "Texture Scale; effective only in COM3D2.5+.",
    "keyword": "Keyword",
    "keyword_no_brackets": "Keyword",
    "keyword_valve": "Value",
    "keyword_tip": "Keyword; used to enable or disable shader features in COM3D2.5+.",
    "add_key_value": "Add Key-Value Pair",
    "undefined": "Undefined",
    "operate": "Operate"
  },
  "PMatEditor": {
    "file_header": {
      "file_head": "File Header (usually no need to modify)",
      "Signature": "File Signature",
      "Version": "File Version",
      "Hash": "Hash",
      "Hash_tip": "Hash; the game needs to calculate the hash for caching (2.42.1). Regardless of the value entered, it will be overwritten with the actual calculated value when saved. Unfortunately, different editors calculate hashes differently, so even if the values are the same, files saved by different editors will differ, resulting in incomplete cache utilization and possibly occupying a few extra KB of memory.",
      "enable_edit_do_not_edit": "Do not modify"
    },
    "materialName": "Material Name",
    "materialName_tip": "Material name; must be exactly the same as the material name in the .mate file header (2.42.1), and the editor will also use it for hash calculation.",
    "renderQueue": "Render Queue",
    "renderQueue_tip": "Render Queue (RQ); the game will set this value to the corresponding render queue (2.42.1), the larger the value, the later the render. Typically, the GPU renders layer by layer, and later renders will overlap on top of previous renders. Default range: 0 - 5000.",
    "shaderName": "Shader Name",
    "shaderName_tip": "Shader Name; not used by the game, and the game doesn't even read this field (2.42.1), but the editor uses it for hash calculation to prevent the same material with different shaders from being cached, which would result in rendering order errors. Therefore, it's best to enter the correct shader name."
  },
  "ColEditor": {
    "file_header": {
      "file_head": "File Header (usually no need to modify)",
      "Signature": "File Signature",
      "Version": "File Version",
      "enable_edit_do_not_edit": "Do not modify"
    },
    "dbc": "Capsule Collider (dbc)",
    "dpc": "Plane Collider (dpc)",
    "dbm": "Chest Collider (dbm)",
    "missing": "Missing (missing)",
    "style1": "Style 1",
    "style2": "JSON",
    "Colliders": "Colliders",
    "add_collider": "Add Collider",
    "collider_type": "Collider Type",
    "ParentName": "Parent Node Name",
    "ParentName_tip": "Parent Node Name (ParentName); the parent node must be a valid Transform node, or it will throw an error 'No physical bone found.' A Transform node can be understood as a bone in modeling software.",
    "SelfName": "Self Node Name",
    "SelfName_tip": "The self node name of the collider (SelfName), it's best to prefix the name with _HIT_, as the official checker will prompt if it's not prefixed with _HIT_. If you don't know what name to choose, you can prefix it with _HIT_ using the parent node's name.",
    "LocalPosition": "Local Position",
    "LocalPosition_tip": "Local Position (LocalPosition); the position of the collider relative to the parent node.",
    "LocalRotation": "Local Rotation",
    "LocalRotation_tip": "Local Rotation (LocalRotation); the rotation of the collider relative to the parent node.",
    "LocalScale": "Local Scale",
    "LocalScale_tip": "Local Scale (LocalScale); the local scale of the collider relative to the parent node.",
    "Direction": "Direction",
    "Direction_tip": "Collider Direction (Direction); specify which axis is the height of the capsule collider, 0 for X axis, 1 for Y axis, 2 for Z axis, default is 1.",
    "Center": "Center",
    "Center_tip": "Local Center (Center); the center point of the collider's local coordinate system, default value is 0,0,0.",
    "Radius": "Radius",
    "Radius_tip": "Radius (Radius); the radius of the capsule collider, default value is 0.5.",
    "Height": "Height",
    "Height_tip": "Height (Height); the height of the capsule collider.",
    "Bound": "Constraint Boundary",
    "Bound_tip": "Constraint Boundary (Bound); specify the collider's boundary constraint, 0 for Outside: prevents bones from entering the collider, 1 for Inside: forces bones to stay within the collider.",
    "ScaleRateMulMax": "Max Scale Multiplier",
    "ScaleRateMulMax_tip": "Max Scale Multiplier (ScaleRateMulMax); controls the maximum scale factor for the collider's radius, which works together with the BlendValue of the MuneL bone. When BlendValue=1.3, the maximum scaling multiplier is reached, and the final radius = base radius * (1 + scale multiplier limit * BlendValue/1.3f), default value is 1.",
    "CenterRateMax": "Max Center Offset",
    "CenterRateMax_tip": "Max Center Offset (CenterRateMax); defines the maximum offset of the center when deformation is at its maximum. It mixes with the base center point (Center) through linear interpolation, and the final center = Vector3.Lerp(center, max center offset, BlendValue/1.3f), default value is 0,0,0.",
    "dbm_tip": "When the character performs deep breathing or chest movement actions, adjusting these two parameters can achieve: the collider's radius increases as the chest expands (max scale multiplier), and the collider's center moves with the action (max center offset), thus maintaining consistency between physical collisions and visual models."
  },
  "PhyEditor": {
    "file_header": {
      "file_head": "File Header",
      "Signature": "File Signature",
      "Version": "File Version",
      "RootName": "Root Node Name",
      "RootName_tip": "Root Node Name (RootName); the name of the root Transform to apply physical effects. This field is not used by the game but is read and discarded, although it's not recommended to leave it empty to avoid possible reading errors (2.42.1).",
      "enable_edit_do_not_edit": "Do not modify"
    },
    "style1": "Style 1",
    "style2": "JSON",
    "Damping": "Damping",
    "Damping_tip": "Damping; Decay rate that controls the attenuation speed of bone movement. Higher values result in slower swinging (slower return to original position), lower values result in faster swinging (0=fastest decay, 1=slowest decay), default 0.5",
    "Elasticity": "Elasticity",
    "Elasticity_tip": "Elasticity; Restoring force that resists positional changes. Controls how quickly bones return to their original positions. 1 means almost no movement (0=no resistance, 1=maximal resistance to displacement), default 0.1",
    "Stiffness": "Stiffness",
    "Stiffness_tip": "Stiffness; Coefficient determining how well bones maintain their original orientation. Higher values make bones appear stiffer with less deformation (0=softest, 1=hardest), default 0.1",
    "Inert": "Inertia",
    "Inert_tip": "Inertia; Controls bone's responsiveness to character movement. Higher values reduce position changes during fast movement (0=full response, 1=partial ignore), default 0",
    "Radius": "Radius",
    "Radius_tip": "Radius; Base collision detection range. Larger values increase collision detection area between bones and other objects, default 0",
    "other": "Other Parameters",
    "EndLength": "End Bone Length",
    "EndLength_tip": "End Bone Length; When non-zero, creates additional bones at the end of Transform hierarchy for physics simulation (can be understood as extra bones appended to the last bone segment). Default 0",
    "EndOffset": "End Bone Offset",
    "EndOffset_tip": "End Bone Offset; Local coordinate offset for end bones. No end bones will be added if all values are 0, default 0,0,0",
    "Gravity": "Gravity",
    "Gravity_tip": "Gravity; Force applied to bones that automatically eliminates internal stress from initial poses (positive values push, negative values pull on XYZ axes), default 0,0,0",
    "Force": "External Force",
    "Force_tip": "External Force; Continuous force applied to bones (positive values push, negative values pull on XYZ axes), default 0,-0.01,0",
    "Collider": "Collider",
    "ColliderFileName": "Collider File Name",
    "ColliderFileName_tip": "Collider File Name (ColliderFileName); enter the name of the foobar.col file, but without the .col extension. It's recommended to have the same name as the phy file. If not entered, the game will try to read the object name from .model and add .col.",
    "ColliderCount": "Collider Count",
    "ColliderCount_tip": "Collider Count (ColliderCount); the number of colliders, which corresponds to the number of colliders in the col file mentioned in 'Collider File Name'. Clicking the auto-calculate button will automatically search for the col file in the same folder and calculate the collider count. This value is used to initialize the collider list.",
    "auto_count": "Auto Calculate",
    "ExclusionsCount": "Exclusions Count",
    "ExclusionsCount_tip": "Exclusions Count (ExclusionsCount); seems to be the number of bones to be excluded, but only the count is provided without specific bone names. This feature might have been deprecated (2.42.1).",
    "FreezeAxis": "Freeze Axis",
    "FreezeAxis_tip": "Freeze Axis (FreezeAxis); freezes the bone's movement to only the specified axis. For example, if the X axis is frozen, the bone can only move in the Y Z plane. This has a lower priority than collision handling. Default value is 0.",
    "FreezeAxis_None": "None (0)",
    "PartialMode": "Mode",
    "PartialMode_tip": "Mode (PartialMode); 0 Static or Curve: uses the default value or curve, 1 By Bone Name: manually set values for each bone by name, 2 By old bone name, limited to _yure_hair_ and _skirt_ Automatically match the value by bone name. The bone name needs to contain the keyword _h_ or _h50_. Set different values ​​according to whether there is a keyword. If it is _skirt_, only _h_ can be used (old version, not recommended).",
    "PartialMode_StaticOrCurve": "Static or Curve (0) (StaticOrCurve)",
    "PartialMode_Partial": "By Bone Name (1) (Partial)",
    "PartialMode_FromBoneName": "By Old Bone Name (2) (FromBoneName)",
    "default_value": "Default Value",
    "default_value_tip": "Default Value (DefaultValue); this value is used only when Mode 0 is selected and no keyframe is used.",
    "BoneValue": "Bone Value",
    "add_BoneValue": "Add Bone Value",
    "BoneName": "Bone Name",
    "Value": "Value",
    "operate": "Operate",
    "keyframe": "Keyframe (Curve)",
    "keyframe_tip": "Keyframe (keyframe); keyframe for bone values, which can turn the bone's physical characteristics into a curve. This is used only when Mode 0 is selected, and if no keyframe is entered, the default value will be used.",
    "add_keyframe": "Add Keyframe",
    "Time": "Time",
    "InTangent": "In Tangent",
    "OutTangent": "Out Tangent",
    "show_visual_editor": "Show Visual Editor",
    "hide_visual_editor": "Hide Visual Editor",
    "visual_editor_tip": "Double-click the blank canvas to add a new keyframe | Drag control points to adjust tangents | Drag keyframe points to adjust position"
  },
  "SettingsPage": {
    "check_update_now": "Check for updates Now",
    "is_check_update": "Check for updates",
    "is_check_update_tip": "Defaults to true, accessing the Github API to get the latest version information, checking once every 24 hours. If the last check failed, it will check again after 1 hour. If browser cache is cleared, this option will reset.",
    "dismiss_update_note": "Dismiss update notice",
    "dismiss_update_note_tip": "Dismiss the update notice. If a new version is available, it will show a prompt unless manually dismissed. You need to disable the update check to prevent the prompt from appearing in the next check."
  },
  "Infos": {
    "com3d2_menu_file": "COM3D2 Menu File",
    "com3d2_mate_file": "COM3D2 Material File",
    "com3d2_pmat_file": "COM3D2 Render Queue File",
    "com3d2_col_file": "COM3D2 Collider File",
    "com3d2_phy_file": "COM3D2 Physics File",
    "com3d2_anm_file": "COM3D2 Animation File",
    "com3d2_model_file": "COM3D2 Model File",
    "com3d2_psk_file": "COM3D2 Skirt Physics File",
    "com3d2_mod_files": "COM3D2 MOD Files",
    "pls_open_file_first": "Please open a file first",
    "editing_colon": "Editing: ",
    "success_save_file": "File saved successfully",
    "success_save_as_file": "File saved as successfully",
    "success_save_as_file_colon": "File saved as successfully: ",
    "auto_count_success": "Auto count successful",
    "check_update_success_new_version_available": "Check update successfully, a new version is available, please go to the homepage to update",
    "check_update_success_no_new_version": "Check update successfully, no new version is available"
  },
  "Errors": {
    "fail_to_check_update": "Failed to check updates",
    "file_selection_error_colon": "File selection error: ",
    "read_menu_file_failed_colon": "Failed to read .menu file: ",
    "read_mate_file_failed_colon": "Failed to read .mate file: ",
    "read_pmate_file_failed_colon": "Failed to read .pmat file: ",
    "read_col_file_failed_colon": "Failed to read .col file: ",
    "read_phy_file_failed_colon": "Failed to read .phy file: ",
    "read_anm_file_failed_colon": "Failed to read .anm file: ",
    "read_model_file_failed_colon": "Failed to read .model file: ",
    "read_psk_file_failed_colon": "Failed to read .psk file: ",
    "read_tex_file_failed_colon": "Failed to read .tex file: ",
    "pls_open_file_first_new_file_use_save_as": "Please open a file first. For new files, use Save As",
    "pls_load_file_first": "Please load a file first",
    "save_file_failed_colon": "Failed to save file: ",
    "save_as_file_failed_colon": "Failed to save as file: ",
    "json_root_node_not_array": "JSON root node is not an array",
    "json_parse_failed": "JSON parsing failed",
    "no_file_to_save": "No file available for saving",
    "invalid_path_or_mate_data": "Invalid file path or Mate data",
    "file_type_not_supported": "File type not supported yet",
    "autoCalcColliderError": {
      "pls_fill_file_name_first": "Please fill in the collider filename first",
      "read_file_filed": "Failed to read corresponding col file"
    }
  }
}